"""
    语句
    选择语句
        if 条件一：
            满足条件执行的代码
        elif 条件二：
            满足条件执行的代码
        else：
            不满足条件执行的代码
    循环语句
        while 条件：
            满足条件执行的代码
        else：
            不满足条件执行的代码
        不知道次数但知道条件用while
    经典案例
    对折纸张，到珠穆朗玛峰高度

        for
        for 变量名 in 可迭代对象：
        约定次数用适合用for

    随机加法考试题
    在终端中获取两个数字累加的结果
    请输入
    如果答对加十分，打错减五分
    经典案例
    三个数学题计算问题



    字符串
    由一系列字符组成的不可变序列容器，存储的是字符的编码值。
    1、不可变
    原因：如果修改可能破坏其他的数据
"""
number = ord("西")
print(number,chr(10492))